# NumberingSchemaType Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchemaType Constructor
NumberingSchemaType Class See Also
---
Creates a new NumberingSchemaType instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public NumberingSchemaType(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
NumberingSchemaType(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the NumberingSchemaType.
# See Also
NumberingSchemaType Class
Autodesk.Revit.DB Namespace